<?php

return [
    'admin' => [
        'destroy' => [
            'title' => 'هل أنت متأكد من حذف هذا السجل؟',
            'ok' => 'تم حذف المسؤول بنجاح.',
            'error' => 'خطأ في حذف المسؤول',
            'not_found' => 'المسؤول غير موجود',
        ],
        'store' => [
            'ok' => 'تم إنشاء المسؤول بنجاح.',
            'error' => 'خطأ في إنشاء المسؤول',
        ],
        'update' => [
            'ok' => 'تم تحديث المعلومات بنجاح!',
            'error' => 'خطأ في التحديث!',
        ],
        'login' => [
            'ok' => 'تم تسجيل الدخول بنجاح.',
            'error' => 'خطأ في تسجيل الدخول',
        ],
    ],
    'product' => [
        'destroy' => ['title' => 'هل أنت متأكد من حذف هذا السجل؟',
            'ok' => 'تم حذف المنتج بنجاح.',
            'error' => 'خطأ في حذف المنتج',
            'not_found' => 'المنتج غير موجود',
        ],
        'store' => [
            'ok' => 'تم إنشاء المنتج بنجاح.',
            'error' => 'خطأ في إنشاء المنتج',
        ],
    ],
];
