<?php

return [
    'admin' => [
        'destroy' => [
            'title' => 'هل أنت متأكد من حذف هذا السجل؟',
            'ok' => 'تم حذف المسؤول بنجاح.',
            'error' => 'خطأ في حذف المسؤول',
            'not_found' => 'المسؤول غير موجود',
        ],
        'store' => [
            'ok' => 'تم إنشاء المسؤول بنجاح.',
            'error' => 'خطأ في إنشاء المسؤول',
        ],
        'update' => [
            'ok' => 'تم تحديث المعلومات بنجاح!',
            'error' => 'خطأ في التحديث!',
        ],
        'login' => [
            'ok' => 'تم تسجيل الدخول بنجاح.',
            'error' => 'خطأ في تسجيل الدخول',
        ],
    ],
    'order' => [
        'store' => [
            'ok' => 'تم تقديم طلبك بنجاح. شكرًا لشرائك!',
            'error' => 'حدث خطأ أثناء تقديم طلبك. يرجى المحاولة مرة أخرى.',
        ],
    ],
    'cart' => [
        'checkout' => [
            'ok' => 'تم إتمام عملية الدفع بنجاح. شكرًا لشرائك!',
            'error' => 'حدث خطأ أثناء عملية الدفع. يرجى المحاولة مرة أخرى.',
        ],
    ], ,
    'customer' => [
        'store' => [
            'ok' => 'تم إنشاء حسابك بنجاح. مرحبًا بك!',
            'error' => 'حدث خطأ أثناء إنشاء حسابك. يرجى المحاولة مرة أخرى.',
        ],
        'update' => [
            'ok' => 'تم تحديث المعلومات بنجاح.',
            'error' => 'حدث خطأ أثناء تحديث المعلومات. يرجى المحاولة مرة أخرى.',
        ],
        'login' => [
            'ok' => 'تم تسجيل الدخول بنجاح. مرحبًا بعودتك!',
            'error' => 'خطأ في تسجيل الدخول. يرجى التحقق من بيانات الاعتماد الخاصة بك والمحاولة مرة أخرى.',
        ],
    ],
    'product' => [
        'destroy' => [
            'title' => 'هل أنت متأكد من حذف هذا السجل؟',
            'ok' => 'تم حذف المنتج بنجاح.',
            'error' => 'خطأ في حذف المنتج',
            'not_found' => 'المنتج غير موجود',
            'has_order' => 'لا يمكن حذف المنتج لوجود طلبات مرتبطة به',
        ],
        'store' => [
            'ok' => 'تم إنشاء المنتج بنجاح.',
            'error' => 'خطأ في إنشاء المنتج',
        ],
        'update' => [
            'ok' => 'تم تحديث المنتج بنجاح.',
            'error' => 'خطأ في تحديث المنتج',
        ],
        'specification' => [
            'update' => [
                'ok' => 'تم تحديث المواصفات بنجاح.',
                'error' => 'خطأ في تحديث المواصفات',
            ],
        ],
    ],
    'category' => [
        'destroy' => [
            'title' => 'هل أنت متأكد من حذف هذا السجل؟',
            'ok' => 'تم حذف الفئة بنجاح.',
            'error' => 'خطأ في حذف الفئة',
            'not_found' => 'الفئة غير موجودة',
            'has_product' => 'لا يمكن حذف التصنيف لوجود منتجات مرتبطة به',
            'has_children' => 'لا يمكن حذف التصنيف لوجود تصنيفات فرعية تابعة له',

        ],
        'store' => [
            'ok' => 'تم إنشاء الفئة بنجاح.',
            'error' => 'خطأ في إنشاء الفئة',
        ],
        'update' => [
            'ok' => 'تم تحديث الفئة بنجاح.',
            'error' => 'خطأ في تحديث الفئة',
        ],
        'products' => [
            'error' => 'حدث خطأ أثناء استرجاع المنتجات. يرجى المحاولة مرة أخرى.',
        ],

    ],
    'brand' => [
        'destroy' => [
            'title' => 'هل أنت متأكد من حذف هذا السجل؟',
            'ok' => 'تم حذف العلامة التجارية بنجاح.',
            'error' => 'خطأ في حذف العلامة التجارية',
            'not_found' => 'العلامة التجارية غير موجودة',
            'has_product' => 'لا يمكن حذف العلامة التجارية لوجود منتجات مرتبطة بها',
        ],
        'store' => [
            'ok' => 'تم إنشاء العلامة التجارية بنجاح.',
            'error' => 'خطأ في إنشاء العلامة التجارية',
        ],
        'update' => [
            'ok' => 'تم تحديث العلامة التجارية بنجاح.',
            'error' => 'خطأ في تحديث العلامة التجارية',
        ],
    ],
    'specification' => [
        'destroy' => [
            'title' => 'هل أنت متأكد من حذف هذا السجل؟',
            'ok' => 'تم حذف المواصفة بنجاح.',
            'error' => 'خطأ في حذف المواصفة',
            'not_found' => 'المواصفة غير موجودة',
            'has_product' => 'لا يمكن حذف المواصفة لوجود منتجات مرتبطة بها',
        ],
        'store' => [
            'ok' => 'تم إنشاء المواصفة بنجاح.',
            'error' => 'خطأ في إنشاء المواصفة',
        ],
        'update' => [
            'ok' => 'تم تحديث المواصفة بنجاح.',
            'error' => 'خطأ في تحديث المواصفة',
        ],
    ],
    'vendor' => [
        'destroy' => [
            'title' => 'هل أنت متأكد من حذف هذا السجل؟',
            'ok' => 'تم حذف البائع بنجاح.',
            'error' => 'خطأ في حذف البائع',
            'not_found' => 'البائع غير موجود',
            'has_product' => 'لا يمكن حذف البائع لوجود منتجات مرتبطة به',
        ],
        'store' => [
            'ok' => 'تم إنشاء البائع بنجاح.',
            'error' => 'خطأ في إنشاء البائع',
        ],
        'update' => [
            'ok' => 'تم تحديث البائع بنجاح.',
            'error' => 'خطأ في تحديث البائع',
        ],
    ],
];
