<?php

return [
    'nike' => 'نایک',
    'adidas' => 'آدیداس',
    'puma' => 'پوما',
    'reebok' => 'ریباک',
    'descriptions' => [
        'nike' => 'نایک یک برند جهانی است که به خاطر کفش‌های ورزشی، پوشاک و تجهیزات خود شناخته شده است.',
        'adidas' => 'آدیداس یک تولیدکننده پیشرو در زمینه پوشاک ورزشی است که به خاطر طراحی‌های نوآورانه و محصولات با کیفیت خود شناخته می‌شود.',
        'puma' => 'پوما یک برند ورزشی معروف است که مجموعه وسیعی از کفش‌ها، پوشاک و لوازم جانبی را ارائه می‌دهد.',
        'reebok' => 'ریباک یک برند ورزشی و سبک زندگی است که در زمینه کفش‌ها و پوشاک ورزشی تخصص دارد.',
    ],
    'under_armour' => 'آندر آرمور',
    'descriptions' => [
        'under_armour' => 'آندر آرمور یک برند ورزشی است که به خاطر فناوری‌های نوآورانه در پوشاک ورزشی شناخته می‌شود.',
    ],
];
